vinhlephu-lpv/robot-ws/src/esp32_source/code0109.ino
// Khai báo nguyên mẫu hàm
void stopMotor(bool emergency);
void stopMotor();
void setVehicleSpeed(int spd);
void updateWheelHealth();
void updatePID(float dt);

// ============================================================
//  7. TÍNH TOÁN VẬN TỐC & SỨC KHỎE BÁNH XE
// ============================================================
inline float median3(float a, float b, float c) {
  if ((a <= b && b <= c) || (c <= b && b <= a)) return b;
  if ((b <= a && a <= c) || (c <= a && a <= b)) return a;
  return c;
}

float calculateMovingAverage(float buffer[], int size) {
  float sum = 0;
  for (int i = 0; i < size; i++) sum += buffer[i];
  return sum / size;
}

void calculateSpeed() {
  unsigned long now = millis();
  if (now - lastSpeedCalcTime < SPEED_CALC_INTERVAL_MS) return;
  float dt = (now - lastSpeedCalcTime) / 1000.0f;
  lastSpeedCalcTime = now;

  for (int i = 0; i < 4; i++) {
    noInterrupts();
    long curCount = enc[i].count;
    interrupts();

    long pulses = curCount - enc[i].lastSpeedCount;
    enc[i].lastSpeedCount = curCount;

    // 1. TẤM KHIÊN GIỚI HẠN VẬT LÝ TUYỆT ĐỐI (Physical Pulse Clamp):
    if (labs(pulses) > 45) {
      pulses = (pulses > 0) ? 45 : -45;
    }

    // 2. BỘ LỌC CHỐNG TRÔI ẢO KHI DỪNG (Deadband Zero-Motion Suppression):
    if (!isMoving && wpid[i].targetRPM <= 0.1f && labs(pulses) <= 1) {
      pulses = 0;
    }

    float rawRPM = (pulses * 60.0f) / (ENCODER_PPR * dt);

    // 3. BỘ LỌC TRUNG VỊ 3 ĐIỂM (Median-3 Filter):
    float medRPM = median3(rawRPM, enc[i].rawRpmHist[0], enc[i].rawRpmHist[1]);
    enc[i].rawRpmHist[1] = enc[i].rawRpmHist[0];
    enc[i].rawRpmHist[0] = rawRPM;

    // 4. BỘ LỌC QUÁN TÍNH CHỐNG ĐỘT BIẾN (Physical Inertia Outlier Filter):
    if (fabsf(medRPM) > MAX_PLAUSIBLE_RPM || (isMoving && fabsf(medRPM - enc[i].prevFilteredRpm) > 50.0f)) {
      medRPM = enc[i].prevFilteredRpm;
    }

    enc[i].rpmBuffer[enc[i].bufferIndex] = medRPM;
    enc[i].bufferIndex = (enc[i].bufferIndex + 1) % MOVING_AVG_SIZE;
    
    // 1. Bộ lọc Trung bình trượt + EMA lọc thô
    float movingAvgRPM = calculateMovingAverage(enc[i].rpmBuffer, MOVING_AVG_SIZE);
    float alpha = (fabsf(movingAvgRPM) < 40.0f) ? EMA_LOW_SPEED_ALPHA : EMA_HIGH_SPEED_ALPHA;
    float emaRpm = alpha * movingAvgRPM + (1.0f - alpha) * enc[i].prevFilteredRpm;
    enc[i].prevFilteredRpm = emaRpm;

    // 2. BỘ LỌC KALMAN 1D TỐI ƯU: Loại bỏ nhiễu Gauss, khử trễ pha, cung cấp vận tốc chuẩn xác cho PID
    enc[i].rpm = updateKalman1D(kfRpm[i], emaRpm);

    enc[i].speed_ms   = enc[i].rpm * WHEEL_CIRCUMFERENCE / 60.0f;
    enc[i].distance_m += (labs(pulses) * WHEEL_CIRCUMFERENCE * distCalibScale) / ENCODER_PPR;
  }

#if WHEEL3_ENCODER_FAULT
  enc[3].rpm        = enc[2].rpm;
  enc[3].speed_ms   = enc[2].speed_ms;
  enc[3].distance_m = enc[2].distance_m;
  enc[3].count      = enc[2].count;
#endif

  // Gửi Odometry phản hồi lên ROS 2 qua Serial (20 Hz)
  float v_left  = (enc[0].speed_ms + enc[1].speed_ms) / 2.0f;
  float v_right = (enc[2].speed_ms + enc[3].speed_ms) / 2.0f;

  if (currentDirection == "BACKWARD") {
    v_left  = -fabsf(v_left);
    v_right = -fabsf(v_right);
  } else if (currentDirection == "LEFT") {
    v_left  = -fabsf(v_left);
    v_right = fabsf(v_right);
  } else if (currentDirection == "RIGHT") {
    v_left  = fabsf(v_left);
    v_right = -fabsf(v_right);
  } else if (currentDirection == "ROS") {
    v_left  = (rosTargetRpmSigned[0] < 0) ? -fabsf(v_left) : fabsf(v_left);
    v_right = (rosTargetRpmSigned[2] < 0) ? -fabsf(v_right) : fabsf(v_right);
  } else {
    if (slew[0].target < 0) v_left  = -fabsf(v_left);
    if (slew[2].target < 0) v_right = -fabsf(v_right);
  }

  if (!isMoving || (fabsf(enc[0].rpm) < 1.0f && fabsf(enc[1].rpm) < 1.0f)) v_left = 0.0f;
  if (!isMoving || (fabsf(enc[2].rpm) < 1.0f && fabsf(enc[3].rpm) < 1.0f)) v_right = 0.0f;

  // 1. Giao thức ODOM chuẩn ROS 2 (m/s)
  Serial.printf("ODOM %.3f %.3f\n", v_left, v_right);

  // 2. Giao thức ENC 4 bánh (ticks & dt_ms)
  unsigned int dt_ms = (unsigned int)(dt * 1000.0f + 0.5f);
  Serial.printf("ENC %ld %ld %ld %ld %u\n", enc[0].count, enc[1].count, enc[2].count, enc[3].count, dt_ms);

  // Điều khiển tự động chạy đúng quãng đường theo mét (Smooth Trapezoidal Distance Profile)
  if (isDistanceMode && isMoving) {
    float traveled0 = abs(enc[0].distance_m - startDistMeters[0]);
    float traveled1 = abs(enc[1].distance_m - startDistMeters[1]);
    float traveled2 = abs(enc[2].distance_m - startDistMeters[2]);
    float traveled3 = abs(enc[3].distance_m - startDistMeters[3]);
    float currentTraveled = (traveled0 + traveled1 + traveled2 + traveled3) / 4.0f;

    float remaining = targetDistMeters - currentTraveled;

    if (remaining <= 0.02f) { // Khi vừa chạm đích (còn dưới 2cm)
      isDistanceMode = false;
      manualDriveActive = false;
      currentDirection = "STOP";
      for (int i = 0; i < 4; i++) {
        wpid[i].targetRPM = 0.0f;
        slew[i].target = 0;
      }

      float maxRpm = 0.0f;
      for (int k = 0; k < 4; k++) {
        float r = fabs(enc[k].rpm);
        if (r > maxRpm) maxRpm = r;
      }
      if (maxRpm < 2.0f) {
        writeAllDrives(0, 0, 0, 0);
        isMoving = false;
        isPositionAnchorLocked = true;
        for (int i = 0; i < 4; i++) anchorTargetPulses[i] = enc[i].count;
        Serial.printf("\n[DIST] >>> DA TOI DICH! Dung chinh xac: %.3fm | KICH HOAT KHOA NEO TOA DO <<<\n\n", currentTraveled);
      }
    } else if (remaining < DECEL_DIST_THRESHOLD) {
      float ratio = constrain(remaining / DECEL_DIST_THRESHOLD, 0.0f, 1.0f);
      float decelRPM = 4.0f + (distCruiseRPM - 4.0f) * (ratio * ratio);
      decelRPM = constrain(decelRPM, 4.0f, distCruiseRPM);
      for (int i = 0; i < 4; i++) wpid[i].targetRPM = decelRPM;
    }
  }

  updateWheelHealth();
  updatePID(dt);
}

void updateWheelHealth() {
  if (!isMoving) {
    for (int i = 0; i < 4; i++) wHealth[i] = {false, false, false, 0, 0};
    return;
  }
  unsigned long now = millis();

  float totalRpm = 0.0f;
  for (int i = 0; i < 4; i++) totalRpm += abs(enc[i].rpm);
  float avgRpm = totalRpm / 4.0f;

