vinhlephu-lpv/robot-ws/src/esp32_source/code0109.ino
  for (int i = 0; i < 4; i++) {
#if WHEEL3_ENCODER_FAULT
    if (i == 3) { wHealth[3] = wHealth[2]; continue; }
#endif
    float rpm = abs(enc[i].rpm);
    int   pwm = abs(slew[i].target);
    float tgt = wpid[i].targetRPM;

    // 1. Phát hiện kẹt cứng / hỏng encoder
    if (pwm > STALL_PWM_THRESHOLD && rpm < STALL_RPM_THRESHOLD) {
      if (wHealth[i].stallStartTime == 0) wHealth[i].stallStartTime = now;
      if (now - wHealth[i].stallStartTime > STALL_DETECT_MS && !wHealth[i].isStalled) {
        wHealth[i].isStalled = true;
        Serial.printf("[HEALTH] CANH BAO: Banh %d bi KHOA/HONG!\n", i + 1);
      }
    } else {
      wHealth[i].stallStartTime = 0;
      wHealth[i].isStalled = false;
    }

    // 2. Phát hiện bánh bị hẫng: Chỉ áp dụng khi chạy chế độ tự hành quãng đường
    if (isDistanceMode && tgt > 0 && avgRpm > 0.1f && rpm > 1.4f * tgt && rpm > 1.5f * avgRpm) {
      if (wHealth[i].hangStartTime == 0) wHealth[i].hangStartTime = now;
      if (now - wHealth[i].hangStartTime > 400 && !wHealth[i].isHanging) {
        wHealth[i].isHanging = true;
        Serial.printf("[HEALTH] PHAT HIEN: Banh %d bi HANG mat tiep xuc dat!\n", i + 1);
      }
    } else {
      wHealth[i].hangStartTime = 0;
      wHealth[i].isHanging = false;
    }

    wHealth[i].isFaulty = (wHealth[i].isStalled || wHealth[i].isHanging);
  }
}

// ============================================================
//  8. THUẬT TOÁN PID + TORQUE BOOST + TỰ BÙ MÔ-MEN BÁNH HỎNG/HẪNG
// ============================================================
void updatePID(float dt) {
  if (!pidGlobalEnabled) return;

  // 1. BỘ KHÓA NEO TỌA ĐỘ VỊ TRÍ VẠCH ĐÍCH (Position Anchor Filter)
  if (isPositionAnchorLocked && !isMoving) {
    for (int i = 0; i < 4; i++) {
      long pulseDiff = enc[i].count - anchorTargetPulses[i];
      if (abs(pulseDiff) > 2) {
        int holdPWM = constrain((int)(-pulseDiff * 0.8f * enc[i].sign), -50, 50);
        slew[i].target = holdPWM;
      } else {
        slew[i].target = 0;
      }
    }
    return;
  }

  if (!isMoving) return;

  float actualRPM[4];
  for (int j = 0; j < 4; j++) actualRPM[j] = fabsf(enc[j].rpm);

  float avgLeft  = (actualRPM[0] + actualRPM[1]) / 2.0f;
  float avgRight = (actualRPM[2] + actualRPM[3]) / 2.0f;
  float avgTotal = (avgLeft + avgRight) / 2.0f;

  // 2. BỘ KHÓA ĐỒNG TỐC VI SAI TRÁI - PHẢI TỨC THỜI:
  float lrDiff = 0.0f;
  if ((currentDirection == "FORWARD" || currentDirection == "BACKWARD" ||
      (currentDirection == "ROS" && fabsf(rosTargetRpmSigned[0] - rosTargetRpmSigned[2]) < 1.0f)) && isMoving) {
    lrDiff = avgLeft - avgRight;
  }
  float lrCorrection = constrain(lrDiff * K_LR_BALANCE, -18.0f, 18.0f);

  for (int i = 0; i < 4; i++) {
#if WHEEL3_ENCODER_FAULT
    if (i == 3) {
      wpid[3].pwmOutput     = wpid[2].pwmOutput;
      wpid[3].prevPwmOutput = wpid[2].prevPwmOutput;
      slew[3].target        = slew[2].target;
      continue;
    }
#endif
    if (!wpid[i].enabled) continue;

    float rpm_act = actualRPM[i];
    float target  = wpid[i].targetRPM;
    bool  isLeft  = (i == 0 || i == 1);

    if (target <= 0.1f) {
      wpid[i].pwmOutput = 0; wpid[i].integral = 0; slew[i].target = 0;
      continue;
    }

    // 1. Feedforward PWM cơ sở tuyến tính 0-255
    float ff_pwm = (target / 220.0f) * 255.0f;
    float coulomb_ff = 0.0f;

    // 2. Sai số bám tốc độ mục tiêu (Tracking Error)
    float track_error = target - rpm_act;
    if (fabsf(track_error) < PID_ERROR_DEADBAND) {
      track_error = 0.0f;
    }

    // 3. Sai số đồng tốc Cross-Coupling 4 bánh:
    float sync_error = 0.0f;
    if (currentDirection == "FORWARD" || currentDirection == "BACKWARD" || 
        (currentDirection == "ROS" && fabsf(rosTargetRpmSigned[0] - rosTargetRpmSigned[2]) < 1.0f)) {
      sync_error = (avgTotal - rpm_act);
    }

    // 4. Sai số tổng hợp đưa vào khâu PID:
    float total_error = track_error + (sync_error * K_SYNC_CROSS_WHEEL);

    // 5. Khâu tích phân (Integral) có Anti-Windup thích ứng theo dải tốc độ:
    float maxIntegral = (target <= 65.0f) ? 50.0f : 100.0f;
    wpid[i].integral = constrain(wpid[i].integral + total_error * dt, -maxIntegral, maxIntegral);

    // 6. Khâu vi phân (Derivative) có lọc nhiễu
    float rawDeriv = (total_error - wpid[i].lastError) / dt;
    wpid[i].filteredDeriv = DERIVATIVE_FILTER * rawDeriv + (1.0f - DERIVATIVE_FILTER) * wpid[i].filteredDeriv;
    wpid[i].lastError = total_error;

    // 7. Tính toán PID cơ sở
    float pid_corr = (wpid[i].kp * total_error) + (wpid[i].ki * wpid[i].integral) + (wpid[i].kd * wpid[i].filteredDeriv);

    // 8. Bù cân bằng cụm Trái - Phải trực tiếp:
    float balance_corr = isLeft ? (-lrCorrection) : (lrCorrection);

    // Đồng bộ nội bộ giữa 2 bánh cùng bên
    float side_sync = isLeft ? (avgLeft - rpm_act) : (avgRight - rpm_act);
    float internal_sync_corr = side_sync * 0.40f;

    // 9. BÙ MÔ-MEN XOẮN TỐC ĐỘ THẤP THÍCH ỨNG TẢI (Adaptive Low-Speed Boost)
    float torque_boost = 0.0f;
    if (target < 75.0f && track_error > 1.0f) {
      float defectRatio = constrain(track_error / target, 0.0f, 1.0f);
      torque_boost = defectRatio * 35.0f; // Bơm thêm lực nhẹ khi tải nặng làm tụt tốc
    }

    // Khâu ghì hãm êm ái chống vọt tốc độ khi chạy chậm
    if (rpm_act > target + 1.0f) {
      pid_corr -= (rpm_act - target) * 2.5f;
    }

    // 10. Tổng hợp PWM điều khiển hoàn chỉnh (Toàn dải 0-255):
    int desired = constrain((int)(ff_pwm + coulomb_ff + pid_corr + balance_corr + internal_sync_corr + torque_boost), 0, 255);

    // Trần an toàn thích ứng tải ở tốc độ thấp:
    if (target <= 65.0f) {
      int safeLowSpeedCap = constrain((int)((target / 65.0f) * 140.0f + (track_error > 3.0f ? 50 : 0) + max(0.0f, wpid[i].integral * 0.8f)), 25, 255);
      if (rpm_act >= target * 0.90f && desired > safeLowSpeedCap) {
        desired = safeLowSpeedCap;
      }
    } else {
      int userPwmCap = (currentDirection == "ROS") ? 255 : max((int)currentSpeed, 0);
      if (rpm_act >= target * 0.5f && desired > userPwmCap) {
        desired = userPwmCap;
      }
    }

    // Giới hạn biến thiên PWM bất đối xứng
    int maxChange = (desired > wpid[i].prevPwmOutput) ? MAX_PWM_CHANGE_UP : MAX_PWM_CHANGE_DOWN;
    int delta   = constrain(desired - wpid[i].prevPwmOutput, -maxChange, maxChange);
    wpid[i].pwmOutput     = constrain(wpid[i].prevPwmOutput + delta, 0, 255);
    wpid[i].prevPwmOutput = wpid[i].pwmOutput;
    
    // XỬ LÝ ĐẶC BIỆT CHO BÁNH BỊ SỰ CỐ:
    if (wHealth[i].isStalled) { 
      wpid[i].pwmOutput = max(0, wpid[i].pwmOutput - 50); 
      wpid[i].integral = 0; 
    } else if (wHealth[i].isHanging) {
      wpid[i].pwmOutput = 0;
      wpid[i].integral = 0;
    }

    // 9. Quy tắc chiều quay 4 bánh (Tank Drive & ROS)
    int sign = 0;
    if (currentDirection == "FORWARD")       sign = 1;
    else if (currentDirection == "BACKWARD") sign = -1;
    else if (currentDirection == "LEFT")     sign = isLeft ? -1 : 1;
    else if (currentDirection == "RIGHT")    sign = isLeft ? 1 : -1;
    else if (currentDirection == "ROS")      sign = (rosTargetRpmSigned[i] >= 0.0f) ? 1 : -1;

    slew[i].target = sign * wpid[i].pwmOutput;
  }
}

