vinhlephu-lpv/robot-ws/src/esp32_source/code0109.ino
// ============================================================
//  9. SLEW RATE LIMITER — KHỞI ĐỘNG MỀM (40 Hz)
// ============================================================
void updateSpeedRamp() {
  unsigned long now = millis();
  if (now - lastRampTime < RAMP_INTERVAL_MS) return;
  lastRampTime = now;

  for (int i = 0; i < 4; i++) {
    float &cur  = slew[i].current;
    int    tgt  = slew[i].target;
    float &step = slew[i].step;

    if (tgt == 0) {
      step = constrain(abs(cur) / 8.0f, RAMP_STEP_MIN, RAMP_STEP_STOP_MAX);
    } else {
      step = constrain(abs((float)tgt - cur) / 40.0f, RAMP_STEP_MIN, RAMP_STEP_MAX);
    }

    if (abs((float)tgt - cur) <= step) cur = (float)tgt;
    else if (cur < (float)tgt)         cur += step;
    else                               cur -= step;
  }

  writeSingleDrive(DRV1_RPWM, DRV1_LPWM, CH_DRV1_F, CH_DRV1_R, (int)slew[0].current, INV_DRV1);
  writeSingleDrive(DRV2_RPWM, DRV2_LPWM, CH_DRV2_F, CH_DRV2_R, (int)slew[1].current, INV_DRV2);
  writeSingleDrive(DRV3_RPWM, DRV3_LPWM, CH_DRV3_F, CH_DRV3_R, (int)slew[2].current, INV_DRV3);
  writeSingleDrive(DRV4_RPWM, DRV4_LPWM, CH_DRV4_F, CH_DRV4_R, (int)slew[3].current, INV_DRV4);
}

// ============================================================
//  10. ĐIỀU KHIỂN HƯỚNG & NHẬN LỆNH
// ============================================================
void setGroupTargets(int speedL, int speedR) {
  slew[0].target = slew[1].target = speedL;
  slew[2].target = slew[3].target = speedR;
}

void writeSpeed(int speed) {
  if (pidGlobalEnabled) return;
  int s = constrain(speed, 0, 255);

  if (currentDirection == "FORWARD")       setGroupTargets(s, s);
  else if (currentDirection == "BACKWARD") setGroupTargets(-s, -s);
  else if (currentDirection == "LEFT")     setGroupTargets(-s, s);
  else if (currentDirection == "RIGHT")    setGroupTargets(s, -s);
  else                                     setGroupTargets(0, 0);
}

void stopMotor(bool emergency) {
  manualDriveActive = false;
  isDistanceMode    = false;
  currentDirection  = "STOP";

  for (int i = 0; i < 4; i++) {
    slew[i].target = 0;
    wpid[i].targetRPM = 0.0f;
    wpid[i].integral = 0; 
    wpid[i].lastError = 0; 
    wpid[i].filteredDeriv = 0;
    wHealth[i] = {false, false, false, 0, 0};
  }

  if (emergency) {
    for (int i = 0; i < 4; i++) {
      slew[i].current = 0.0f;
      wpid[i].pwmOutput = 0;
      wpid[i].prevPwmOutput = 0;
    }
    writeAllDrives(0, 0, 0, 0);
    isMoving = false;
    isPositionAnchorLocked = false;
    Serial.println("\n[STOP] !!! DUNG KHAN CAP (ESTOP) - NGAT DIEN TUC THI !!!\n");
  } else {
    for (int i = 0; i < 4; i++) {
      wpid[i].pwmOutput = 0;
      wpid[i].prevPwmOutput = 0;
    }
    Serial.println("\n[STOP] Dung em ai - Giam toc muot qua Slew Rate...\n");
  }
}

void stopMotor() {
  stopMotor(false);
}

// ============================================================
// HÀM CẬP NHẬT TỐC ĐỘ XE TẬP TRUNG (DÙNG CHO CẢ APP, WEB, SERIAL)
// ============================================================
void setVehicleSpeed(int spd) {
  currentSpeed = constrain(spd, 0, 255);
  
  if (currentSpeed == 0) {
    stopMotor(false);
    Serial.println("[SPEED] Toc do = 0 -> Dung xe.");
    return;
  }
  
  globalTargetRPM = (currentSpeed / 255.0f) * 220.0f;
  for (int i = 0; i < 4; i++) {
    wpid[i].targetRPM = globalTargetRPM;
  }
  
  if (!pidGlobalEnabled && isMoving && currentDirection != "STOP") {
    writeSpeed(currentSpeed);
  }
  
  Serial.printf("[SPEED] >> DA CAP NHAT TOC DO: PWM = %d (%.0f%%) | Target RPM = %.1f\n", 
                currentSpeed, (currentSpeed / 255.0f) * 100.0f, globalTargetRPM);
}

void handleCommand(String command) {
  command.trim();
  if (command.length() == 0) return;

  // Lệnh kiểm tra IP kết nối App từ Serial Monitor
  if (command == "IP" || command == "ip") {
    Serial.println();
    Serial.println("=========================================");
    if (WiFi.status() == WL_CONNECTED) {
      Serial.print  ("  >> IP KET NOI APP: ");
      Serial.println(WiFi.localIP());
      Serial.printf ("  >> WiFi SSID    : %s (Tin hieu: %d dBm)\n", WiFi.SSID().c_str(), WiFi.RSSI());
    } else {
      Serial.println("  [CHUA CO IP] Xe chua ket noi vao WiFi!");
      Serial.printf ("  SSID dang cau hinh: %s\n", ssid);
      Serial.println("  Hay kiem tra lai ten WiFi va mat khau o dong 71-72!");
    }
    Serial.println("=========================================\n");
    return;
  }

  // Lệnh chạy khoảng cách theo mét: chỉ kích hoạt khi gõ lệnh "DIST <mét>"
  if (command.startsWith("DIST ") || command.startsWith("dist ")) {
    float dist = 0.0f;
    float rpm_req = DEFAULT_CRAWL_RPM;
    int parsed = sscanf(command.c_str() + 5, "%f %f", &dist, &rpm_req);
    if (parsed >= 1 && dist > 0.01f) {
      isPositionAnchorLocked = false;
      isDistanceMode = true;
      targetDistMeters = dist;
      distCruiseRPM = (rpm_req > 5.0f && rpm_req <= 120.0f) ? rpm_req : DEFAULT_CRAWL_RPM;
      for (int i = 0; i < 4; i++) {
        startDistMeters[i] = enc[i].distance_m;
        wpid[i].targetRPM = distCruiseRPM;
        wpid[i].integral = 0;
      }
      isMoving = true;
      manualDriveActive = true;
      currentDirection = "FORWARD";
      Serial.printf("\n[DIST] >>> CHAY QUANG DUONG: %.2fm | Toc do: %.1f RPM <<<\n", targetDistMeters, distCruiseRPM);
      return;
    }
  }

  // Lệnh hiệu chuẩn khoảng cách: "CALIB <scale>" (Ví dụ nếu đo 2m ra 2.5m -> gõ "CALIB 0.80")
  if (command.startsWith("CALIB ") || command.startsWith("calib ")) {
    float sc = 1.0f;
    if (sscanf(command.c_str() + 6, "%f", &sc) == 1 && sc > 0.1f && sc < 3.0f) {
      distCalibScale = sc;
      Serial.printf("[CALIB] Da cap nhat he so Calib quang duong = %.4f\n", distCalibScale);
      return;
    }
  }

  // Lệnh Reset Odometry về 0.00m: "RESET_ODOM" hoặc "ZERO"
  if (command == "RESET_ODOM" || command == "ZERO" || command == "RESET" || command == "reset") {
    for (int i = 0; i < 4; i++) {
      enc[i].count = 0;
      enc[i].distance_m = 0.0f;
      enc[i].lastSpeedCount = 0;
      startDistMeters[i] = 0.0f;
    }
    Serial.println("[ODOM] Da Reset quang duong 4 banh ve 0.00m!");
    return;
  }

  // Lệnh vận tốc ROS 2: "V <FL> <RL> <FR> <RR>" hoặc "V <L> <R>" (RPM)
  if (command.startsWith("V ") || command.startsWith("v ") || command.startsWith("V\t") || command.startsWith("v\t")) {
    float r[4] = {0.0f, 0.0f, 0.0f, 0.0f};
    int parsed = sscanf(command.c_str() + 2, "%f %f %f %f", &r[0], &r[1], &r[2], &r[3]);
    if (parsed == 2) {
      r[3] = r[1];
      r[2] = r[1];
      r[1] = r[0];
      parsed = 4;
    }
    if (parsed == 4) {
      lastRosCmdTime = millis();
      if (fabsf(r[0]) < 0.1f && fabsf(r[1]) < 0.1f && fabsf(r[2]) < 0.1f && fabsf(r[3]) < 0.1f) {
        for (int i = 0; i < 4; i++) rosTargetRpmSigned[i] = 0.0f;
        stopMotor(false);
      } else {
        isPositionAnchorLocked = false;
        isDistanceMode = false;
        isMoving = true;
        manualDriveActive = true;
        currentDirection = "ROS";

